Core/src/DataProcessors/ПомощникЗагрузкиБанковскойВыписки/ПомощникЗагрузкиБанковскойВыписки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ПомощникЗагрузкиБанковскойВыписки</name>
  <attributes>
    <name>НачалоПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонецПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>БанковскийСчет</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбменаСИнтернетБанком</name>
    <type>
      <types>EnumRef.ТипыОбменаСИнтернетБанком</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутьКФайлу</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СоздаватьДокументыАвнса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СоздаватьДокументыЗарплаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СоздаватьНеНайденныхКонтрагентов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СоздаватьБанковскиеСчета</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроводитьСозданныеДокументы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаполнятьКоммиссиюВДокументеBOG</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаполнятьКоммиссиюВДокументеTBC</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаИспользованияНовыхIDПеремещений</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТаблицаВыписки</name>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НазначениеПлатежа</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаДт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаКт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипТранзакцийБВ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерДокумента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СчетБанк</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>256</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИНН</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодКазначейство</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипОперации</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Ключ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СчетКорр</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>_ШаблонЗаполнения</name>
      <type>
        <types>CatalogRef.ШаблоныЗаполнения</types>
      </type>
    </attributes>
    <attributes>
      <name>_СсылкаНаДокумент</name>
      <type>
        <types>DocumentRef.РасходСоСчета</types>
        <types>DocumentRef.Конвертация</types>
        <types>DocumentRef.ПеремещениеДС</types>
        <types>DocumentRef.ПоступлениеНаСчет</types>
      </type>
    </attributes>
    <attributes>
      <name>_РасшифрокаTransactionType</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>16</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>_РасшифрокаStatusCode</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>16</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>_ОписаниеОшибки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>256</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>_Загружать</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>512</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеКт</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеДт</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СчетБанкКт</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СчетБанкДт</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИННКт</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИННДт</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент1С</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>СчетКонтрагента1С</name>
      <type>
        <types>CatalogRef.БанковскиеСчета</types>
      </type>
    </attributes>
    <attributes>
      <name>Подотчетник1С</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаСтрока</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>16</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Баланс</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДокументПроведен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДополнительноеЗначение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ID_Новый</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>512</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Курс</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаКонвертации</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаДтНацВал</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаКтНацВал</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>TransactionID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

Core/src/InformationRegisters/УИДДокументовВИнтернетБанке/УИДДокументовВИнтернетБанке.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УИДДокументовВИнтернетБанке</name>
  <resources>
    <name>УИДДокументаВБанке</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Выгружен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ДокументСсылка</name>
    <type>
      <types>DocumentRef.РасходСоСчета</types>
      <types>DocumentRef.Конвертация</types>
      <types>DocumentRef.ПоступлениеНаСчет</types>
      <types>DocumentRef.ПлатежнаяВедомость</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Банк</name>
    <type>
      <types>CatalogRef.Банки</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Core/src/Documents/ПеремещениеДС/ПеремещениеДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПеремещениеДС</name>
  <registerRecords>AccountingRegister.AzRyХозрасчетныйUSD</registerRecords>
  <registerRecords>AccumulationRegister.ПлатежныйКалендарь</registerRecords>
  <registerRecords>AccountingRegister.Управленческий</registerRecords>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <registerRecords>AccumulationRegister.ДенежныеСредства</registerRecords>
  <registerRecords>AccumulationRegister.ДоходыИРасходы</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДенежныхСредств</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Статья</name>
    <type>
      <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипДенежныхСредств</name>
    <type>
      <types>EnumRef.ТипыДенежныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>БанковскийСчет</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>Касса</name>
    <type>
      <types>CatalogRef.Кассы</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипДенежныхСредствПолучатель</name>
    <type>
      <types>EnumRef.ТипыДенежныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>БанковскийСчетПолучатель</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>КассаПолучатель</name>
    <type>
      <types>CatalogRef.Кассы</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ПеремещениеДСПлан</types>
    </type>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>CatalogRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>ID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>512</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НазначениеПлатежа</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>AzRyПроекты</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерВходящегоДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>TransactionID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Core/src/DataProcessors/ПомощникЗагрузкиБанковскойВыписки/ManagerModule.bsl
Функция НайтиДокументПоИД(ID) ЭКСПОРТ
	
	НаиденныйДок = Документы.РасходСоСчета.НайтиПоРеквизиту("ID",ID);
	
	Если НЕ ЗначениеЗаполнено(НаиденныйДок) Тогда 
		
		НаиденныйДок = Документы.ПоступлениеНаСчет.НайтиПоРеквизиту("ID",ID);
		
		//ИначеЕсли НЕ ЗначениеЗаполнено(НаиденныйДок) Тогда 
		Если НЕ ЗначениеЗаполнено(НаиденныйДок) Тогда 
			
			НаиденныйДок = Документы.ПеремещениеДС.НайтиПоРеквизиту("ID",ID);
			
			Если НЕ ЗначениеЗаполнено(НаиденныйДок) Тогда 
				
				НаиденныйДок = Документы.Конвертация.НайтиПоРеквизиту("ID",ID);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат НаиденныйДок;
	
КонецФункции

Функция НайтиДокументПоШаблонуДатеИНомеру(ШаблонЗаполнения=НЕОПРЕДЕЛЕНО,ДатаДокумента,НомерДокумента,СуммаКт=0,СуммаДт=0) ЭКСПОРТ
	
	НайденныйДокумент = НЕОПРЕДЕЛЕНО;
	
	Если НЕ (ЗначениеЗаполнено(ДатаДокумента) И ЗначениеЗаполнено(НомерДокумента))
		Тогда
	
		Возврат НЕОПРЕДЕЛЕНО;
	
	КонецЕсли;

	НомерДокументаДляПоиска = СокрЛП(НомерДокумента);
	
	Пока СтрДлина(НомерДокументаДляПоиска)<11 Цикл
	
		НомерДокументаДляПоиска = "0"+НомерДокументаДляПоиска;
	
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ШаблонЗаполнения) и СтрДлина(ШаблонЗаполнения.СсылкаИсточника)>0 Тогда //Малышев 2025-06-19
		
		Запрос = Новый Запрос;
		ЗапросТекст = 
		"ВЫБРАТЬ
		|	ТекущийДокумент.Ссылка КАК Ссылка
		|ИЗ
		|	Документ."+ШаблонЗаполнения.СсылкаИсточника+" КАК ТекущийДокумент
		|ГДЕ
		|	НЕ ТекущийДокумент.ПометкаУдаления
		|	И ТекущийДокумент.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И &НомерДокумента ПОДОБНО ТекущийДокумент.Номер + ""%""";
		
		Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(ДатаДокумента));
		Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(ДатаДокумента));
		Запрос.УстановитьПараметр("НомерДокумента", НомерДокументаДляПоиска);
		
		Запрос.Текст = ЗапросТекст;
		
		тзРезультат = Запрос.Выполнить().Выгрузить();
		
		Если тзРезультат.Количество() > 0 Тогда 
			НайденныйДокумент = тзРезультат[0].Ссылка  
		КонецЕсли;
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(НайденныйДокумент) Тогда
	
		Если СуммаКт>0 Тогда
		
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	УИДДокументовВИнтернетБанке.ДокументСсылка КАК ДокументСсылка
			|ИЗ
			|	РегистрСведений.УИДДокументовВИнтернетБанке КАК УИДДокументовВИнтернетБанке
			|ГДЕ
			|	НЕ УИДДокументовВИнтернетБанке.ДокументСсылка.ПометкаУдаления
			|	И УИДДокументовВИнтернетБанке.ДокументСсылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
			|	И УИДДокументовВИнтернетБанке.ДокументСсылка.Номер = &Номер
			|	И УИДДокументовВИнтернетБанке.ДокументСсылка.СуммаДокумента = &СуммаДокумента";
			
			Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(ДатаДокумента));
			Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(ДатаДокумента));
			Запрос.УстановитьПараметр("Номер", НомерДокументаДляПоиска);
			Запрос.УстановитьПараметр("СуммаДокумента", СуммаКт);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Если ВыборкаДетальныеЗаписи.Следующий() Тогда
				НайденныйДокумент = ВыборкаДетальныеЗаписи.ДокументСсылка;
			КонецЕсли;
		
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(НайденныйДокумент) Тогда
			
			Если СуммаДт>0 Тогда
				
				Запрос = Новый Запрос;
				Запрос.Текст = 
				"ВЫБРАТЬ ПЕРВЫЕ 1
				|	УИДДокументовВИнтернетБанке.ДокументСсылка КАК ДокументСсылка
				|ИЗ
				|	РегистрСведений.УИДДокументовВИнтернетБанке КАК УИДДокументовВИнтернетБанке
				|ГДЕ
				|	НЕ УИДДокументовВИнтернетБанке.ДокументСсылка.ПометкаУдаления
				|	И УИДДокументовВИнтернетБанке.ДокументСсылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
				|	И УИДДокументовВИнтернетБанке.ДокументСсылка.Номер = &Номер
				|	И УИДДокументовВИнтернетБанке.ДокументСсылка.СуммаДокумента = &СуммаДокумента";
				
				Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(ДатаДокумента));
				Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(ДатаДокумента));
				Запрос.УстановитьПараметр("Номер", НомерДокументаДляПоиска);
				Запрос.УстановитьПараметр("СуммаДокумента", СуммаДт);
				
				РезультатЗапроса = Запрос.Выполнить();
				
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				
				Если ВыборкаДетальныеЗаписи.Следующий() Тогда
					НайденныйДокумент = ВыборкаДетальныеЗаписи.ДокументСсылка;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
	
	КонецЕсли;
	
	Возврат НайденныйДокумент;
	
КонецФункции

Функция НайтиВРегистреКлючДокументаИнтернетБанка(КлючУникальности) ЭКСПОРТ
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КлючДокументаИнтернетБанка.Документ КАК Документ,
		|	КлючДокументаИнтернетБанка.Ключ КАК Ключ
		|ИЗ
		|	РегистрСведений.КлючДокументаИнтернетБанка КАК КлючДокументаИнтернетБанка
		|ГДЕ
		|	КлючДокументаИнтернетБанка.Ключ = &КлючУникальности";
	
	Запрос.УстановитьПараметр("КлючУникальности", КлючУникальности);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Документ;   
		Прервать;
	КонецЦикла;   
	
	Возврат Неопределено;

КонецФункции // НайтиВРегистреКлючДокументаИнтернетБанка(СтрокаВыписки.ID_Новый)()
